Catalogs/ШаблоныШтрихкодов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ШаблоныШтрихкодов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерЯчейки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляЧего</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипШаблона</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыШаблоновШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ШаблоныШтрихкодов/Forms/ФормаВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Отбор.Свойство("ТипШаблона") Тогда
		Если Параметры.Отбор.ТипШаблона = Перечисления.ТипыШаблоновШтрихкодов.Номенклатура Тогда
			Элементы.ФормаСоздатьНовыйОС.Видимость = Ложь;
		ИначеЕсли Параметры.Отбор.ТипШаблона = Перечисления.ТипыШаблоновШтрихкодов.ОсновныеСредства Тогда
			Элементы.ФормаСоздатьНовыйНоменклатура.Видимость = Ложь;
		КонецЕсли;		

	КонецЕсли;
	
	ДоступностьИзменений = ПравоДоступа("Изменение", Метаданные.Справочники.ШаблоныШтрихкодов);
	
	КнопкаНовыйНоменклатура = Элементы.Найти("ФормаСоздатьНовыйНоменклатура");
	
	Если КнопкаНовыйНоменклатура <> Неопределено Тогда
		КнопкаНовыйНоменклатура.Доступность = ДоступностьИзменений;
	КонецЕсли;
	
	КнопкаНовыйОС = Элементы.Найти("ФормаСоздатьНовыйОС");
	
	Если КнопкаНовыйОС <> Неопределено Тогда
		КнопкаНовыйОС.Доступность = ДоступностьИзменений;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	                
	Если ИмяСобытия = "Запись_ШаблоныШтрихкодов" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	  
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйОС(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ОткрытьРедактор", Истина);
	ПараметрыОткрытия.Вставить("ТипШаблона", ПредопределенноеЗначение("Перечисление.ТипыШаблоновШтрихкодов.ОсновныеСредства"));
	ПараметрыОткрытия.Вставить("Ширина", 45);
	ПараметрыОткрытия.Вставить("Высота", 25);
	
	ОткрытьФорму("Справочник.ШаблоныШтрихкодов.ФормаОбъекта", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовыйНоменклатура(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ОткрытьРедактор", Истина);
	ПараметрыОткрытия.Вставить("ТипШаблона", ПредопределенноеЗначение("Перечисление.ТипыШаблоновШтрихкодов.Номенклатура"));
	ПараметрыОткрытия.Вставить("Ширина", 45);
	ПараметрыОткрытия.Вставить("Высота", 25);
	
	ОткрытьФорму("Справочник.ШаблоныШтрихкодов.ФормаОбъекта", ПараметрыОткрытия);
	
КонецПроцедуры

#КонецОбласти
